[
    {
        "text": "This was a delightful presentation. Hemo (blood) as a Greek god was so well played by the animation with vanity, arrogance, snobbish superiority and innocent wonder. The quote (or scene) I recall vividly is when Hemo tires of \"all this plumbing ... you haven't learned my secrets at all\" and threatens to storm out, the Scientist answers him in a single word \"Thalassa\" -- salt water which horrifies the Fiction Writer but mollifies Hemo and segues so neatly into the chemical aspects of blood. <br /><br />Such a splendid blend of entertainment and information make this a classic as fresh and engrossing today as the day it was released. Stimulating the interest and imagination is fundamental to teaching kids to love learning.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "First things first, this movie is achingly beautiful. A someone who works on 3D CG films as a lighter/compositor, the visuals blew me away. Every second I was stunned by what was on screen As for the story, well, it's okay. It's not going to set the world on fire, but if you like your futuristic Blade Runner-esquire tales (and who doesn't?) then you will be fine.<br /><br />I do have to say that I felt the voice acting was particularly bland and detracted from the movie as a whole. I saw it at the cinema in English, but I am hoping that there is a French version floating around somewhere.<br /><br />Definitely worth seeing.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "An opium den, a dirty little boy (actually a midget), prostitutes galore, a violent fracas in a dive, a motel for sexual shenanigans, scantily clad babes with cleavage a lot, a boozer falling down the stairs, a racially mixed clientèle in a bar with Asians, Africans, and Anglos treated equally, does this sound like a film playing at the local shopping mall? Wrong. These are all scenes from a 1933 musical.<br /><br />The first half of \"Footlight Parade\" is preparation for a musical extravaganza which occupies the last half of the film. Chester Kent (Cagney) is about to lose his job and does lose his playgirl wife as a result of talking pictures squeezing out live stage musicals. His producers take him to see a popular talky of the day, John Wayne in \"The Big Trail.\" Before each showing of the flick, a dance number is presented as a prologue. Shorts, news reels, serials, and cartoons would later serve the purpose. Kent gets the idea that a prologue chain would be the road to salvation for the dwindling live musical business. Kent is basically an idea man along the lines of choreographer Busby Berkeley. Could it be that Cagney's character is patterned after Berkeley? Could be. <br /><br />In preparation for the prologues, Kent learns that his ideas are being stolen by a rival. He uncovers the traitor, fires him, then unbeknown to him a new leak is planted in the form a dazzling temptress. His assistant, Nan Prescott (Joan Blondell - soon to be Mrs. Dick Powell) has the hots for Kent and is determined to expose the wiles of the temptress. A new singer from Arkansas College shows up in the form of Scotty Blain (Dick Powell) who turns out to be a real find and is paired with Bea Thorn (Ruby Keeler). The resulting three prologue musicals, which couldn't possibly have been presented on any cinema stage of the day, are as fresh and enjoyable today as they were over seventy years ago, \"Honeymoon Hotel,\" \"By a Waterfall,\" and \"Shanghai Lil.\"<br /><br />Of special note is the song and dance of tough-guy James Cagney. Like Fred Astaire and Bill \"Bojangles\" Robinson, Cagney's dancing appeared natural and unrehearsed, although hours went into practice to get each step just right. Not as good a singer as Astaire, Cagney's singing, like Astaire's, sounded natural, unlike the crooning so popular at the time. It's amazing that one person could be so talented and so versatile as James Cagney.<br /><br />Most critics prefer the \"Shanghai Lil\" segment over the other two. Yet the kaleidoscopic choreography of \"By a Waterfall\" is astonishing. How Berkeley was able to film the underwater ballets and to create the human snake chain must have been difficult because it has never been repeated. The close up shots mixed brilliantly with distant angles is a must-see. The crisp black and white photography is much more artistic than it would have been if shot in color. <br /><br />Though not nearly as socially conscious as \"Gold Diggers of 1933,\" \"Footlight Parade\" stands on its own as one of the most amazing and outrageous musicals ever put on the big screen.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "Erroll works for The Department of Public Safety and his job is to check up on sex offenders. Sometimes he pushes the line at his job and beats on the sex offenders. I don't blame him but his boss is ready for him to retire so along comes Allison. Erroll is now training her to do his job and it's like job shadowing. Allison is somewhat naive about the job in the beginning but she doesn't realize how much danger she really is and it's all Erroll's fault. He starts to go to far with his obsession of finding a missing girl when his job isn't to be a police officer.<br /><br />It's a fairly decent movie about a crazy guy who pushes the boundaries and works outside his \"scope of practice.\" Erroll did do a good job but at the sake of the safety of Allison. It has some good mystery to it too and just when I had it figured out, there was more to it.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "So why does this show suck? Unfortunately, that really is the only question, because there is no doubt that it does.<br /><br />For those unfamiliar with the premise of the show, the doomed-to-be-shortlived series Cavemen focuses on a number of Neanderthals and their struggle to exist in modern day America and is based on the characters featured in a series of television ads for Geico Insurance. The concept is solid and there is every reason to think it could be executed successfully.<br /><br />I had to think about it for awhile, but then the tagline from the commercials -- something to the effect of \"We're not that much different from you\" provided me with the key to the show's suckiness. Even though cavemen/Neanderthals are actually a different species than humanity, the title characters of this show, it turns out, are exactly the same as those of us who are boring jerks.<br /><br />Maybe its my background as a game writer -- rather than a soulless, hack, committee-based writer from California -- but this show had so much potential, and none of it has been realized. To start with, the producers should have focused on the fun things that would make cavemen different from us.<br /><br />What could conceivably be funny, for example, about giving them occupations like perpetual grad student and furniture store clerk, when they would have more compellingly been drawn to things like subterranean utility workers and guides at cave parks? Why would they play prosaic games like squash, when a whole episode could be devoted to them trying get hunting licenses to go after game with spears? A show like this could write itself, and it takes some willfully bad writing to make it quite so crappy and boring.<br /><br />Another tiresome aspect of this show is an attempt to portray the cavemen as being subjected to a number of stereotypes associated with various human minorities. Yawn! This has been done so many times before, and never more drearily than this. And, as noted previously, Neanderthals really are a different species, so using them as a metaphor for racial stereotyping is both uncompelling and off the mark.<br /><br />Responses are welcome, including those from anyone who wants to tell me why I'm wrong. I'd like to enjoy this show and am just sorry that I have thus far been unable to.<br /><br />Michael J. Varhola, Skirmisher Online Gaming Magazine",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "Well, I must say that this was one hell of a fun movie. Despite the fact that the dubbing was pretty cheesy, and there were some odd moments where the film seemed to turn dark blue for no apparent reason, I was not disappointed. The story was actually pretty interesting: the last member of the Poison Clan must track down the other five members and discover who among them is using their skills for evil, and who is using them for good. The catch being that during training, all of the clan were masked, and all have since returned to society in disguise and changed their names.<br /><br />The fights are a joy to watch, as each member of the Poison Clan has a different fighting style: toad (my favorite), snake, scorpion, lizard, and centipede. The fight scenes have the actors jumping all over the place, and thankfully the camera stays planted and uses a wide enough shot so you can clearly see all of the action.<br /><br />The one drawback to the movie is that the story tends to drag a bit in the first half up until the first fight sequence. But stick with it, and you won't be disappointed!",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "This movie was extremely funny, I would like to own this for my vintage collection of 1970s movie must see again list, I know this cast of characters ,they are people that I have met over the years and that prompt me to search out this comedy, unfortunately this was never put to DVD or VHS. Redd Foxx always a clown of comedy, Pearl Baily a great match as his wife witty and sassy, Norman a son with a secret not sure if he will have a future if it is out,Dennis Dugan crazy funny man . Miss Dobson hooker with a heart and little conscience. Love,lust,strange family ties this movie qualifies for a come back encore performance ,situation comedy with a mix of events as this could and should find its way as a remake, I do think finding cast would be extremely difficult maybe impossible,except Jerry Seinfeld playing Dennis Dugan role, this earmarks a couple of Seinfeld episodes that also brought me back to Norman is that you ,keeping them in the closest was surely impossible as impossible to reform pretend hooker girl friend and infidelity of a parent. This movie was a wild ride advise of a cabbie, remind me of episode Kramer takes advice of his caddie over his lawyer. ( episode from Seinfeld ) The parents have there jaw dropping moment, fun over fun It is screaming bring me back .",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "Yeah, it is. In fact, it's somewhere in my top 20 all time favorite movies. Number 15, I think. Anyways, I'm usually not one for plots, but I think plots work better in anime and RPG video games, (Final Fantasy 7, for example) and not movies. But this one has it all. Vivid drawings of planets, stars, an extremely well written screenplay. While this is not really for children, they can still watch it, it contains no graphic blood, guts and silicone. But I don't think they're going to understand it.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "After too many bad memories, I took to skipping this episode each time it showed up in the Season 2 sequence. I recently watched it again just to remind me why. I've always considered this the worst ST:TNG episode (with the exception of \"Shades of Gray,\" which barely counts as an episode at all).<br /><br />I keep listening to the clunky dialogue and thinking of the script red-penciled by the author's Writing 101 teacher: \"SHOW, DON'T TELL!\" From Deanna Troi's pronouncement, and everyone else's constant elbowing reminders about what a charming, dangerous rogue Okona is, to Guinan's explanation about how funny her droid joke is (it isn't), to the who-cares resolution to the conflict, there isn't a plot point that isn't highlighted and triple-underlined for our edification, and there ain't a believable moment in any of it. Unfortunately, Bill Campbell, a charming actor in other circumstances, is too puppy-dog huggable to be the center of the machinations of the plot. On the other hand, it could be that no one short of John Barrowman (Jack Harkness from \"Doctor Who\") could pull of this underwritten placeholder of a role.<br /><br />(Zero points, by the way, to the Data subplot. While I think Joe Piscopo stopped being funny decades ago, he and Brent Spiner had nothing to work with here. Although the Jerry Lewis bit was funny in a stupid way.)<br /><br />On a good day, you may be able to think of this as a charming little homage to a lesser Original Series episode. Me, I'd rather skip ahead to \"Time Squared\" or \"Q Who.\"",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "Given the title, this first follow-up to QUARTET (1948) obviously reduces the number of W. Somerset Maugham stories which comprise the film. The author still turns up to introduce the episodes, but there’s no epilogue this time around; by the way, while the script of the original compendium gave sole credit to R.C. Sheriff, here Maugham himself also lent a hand in the adaptation, as well as Noel Langley (though it’s unclear whether they contributed one segment each or else worked in unison). As can be expected, much of the crew of QUARTET has been retained for the second installment – though this also extends to at least three cast members, namely Naunton Wayne, Wilfrid Hyde-White and Felix Aylmer (the last two had bit parts in the episode from QUARTET entitled “The Colonel’s Lady”). While TRIO ultimately emerges to be a lesser achievement than its predecessor (slightly unbalanced by the third story which takes up more than half the running-time), it’s still done with the utmost care, acted with verve by a stellar cast and is solidly enjoyable into the bargain.<br /><br />“The Verger” tells of a church sexton (James Hayter) – for which the story’s title is another word – who’s dismissed after 17 years of service by the new parish priest (Michael Hordern) simply because he’s illiterate. Rather than rest on his laurels, despite his age, he not only takes a wife (his landlady, played by Kathleen Harrison) but opens a tobacconist shop strategically placed in a lengthy stretch of road where no such service is offered – and, with business flourishing, this is developed into a whole chain. The last scene, then, sees him pay a visit to bank manager Felix Aylmer who, not only is surprised to learn of Hayter’s lack of education, but is prompted to ask him what his other interests were – to which the wealthy (and respected) tobacconist replies, with some measure of irony, that he had the calling to be a verger! <br /><br />The second episode, “Mr. Know-All”, is the shortest but also perhaps the most engaging: a voyage at sea is utterly beleaguered by the insufferable presence of a pompous young man (Nigel Patrick), British despite his foreign-sounding name of Kelada, who professes to be an authority on virtually every subject under the sun. Naunton Wayne and Wilfrid Hyde-White are the two passengers who have to put up with him the most – the latter because he shares a cabin with the man and the former in view of Patrick’s attentions to his pretty wife (Anne Crawford). During a fancy-dress party, however, the passengers decide to enact their ‘revenge’ on Kelada by having one of them impersonate him (a jest which he naturally doesn’t appreciate)!; still, it’s here that he contrives to show a decent side to his character – told by Crawford that the necklace she’s wearing is an imitation, Wayne challenges Patrick to name its price…but the latter realizes immediately that it’s the genuine article and that this would compromise Crawford’s position if he were to tell, so Kelada allows himself to be publicly ridiculed rather than expose the fact that the woman probably has a secret admirer! <br /><br />As can also be deduced from the title, “Sanatorium” deals with the myriad patients at such a place – run by Andre' Morell; the protagonist is a new intern, Roland Culver, who wistfully observes the various goings-on. The narrative, in fact, highlights in particular three separate strands of plot – one humorous (the ‘feud’ between two aged Scots long resident at the sanatorium, played by Finlay Currie and John Laurie), one melodramatic (the erratic relationship between disgruntled patient Raymond Huntley and long-suffering but devoted wife Betty Ann Davies) and one bittersweet (the romance between naïve but charming Jean Simmons and dashing cad Michael Rennie which, in spite of having pretty much everything against it including the fact that Morell has diagnosed Simmons as a ‘lifer’ while Rennie only has a few years left to him, leads the couple to the altar).",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "I really love this movie, saw it again last week after 3 years or so. This movie is perfect, great acting, great story, great directing/camera-work/music. It is a gift to show it to someone you love. too bad jaco van dormael did not make more movies after this one. Top 5 work. Really!!<br /><br />Today, it's 3 years and 3 days later then the comment above. it was never posted because it was not more than 10 lines. Anyway, i saw \"le huitieme jour\" again yesterday. This is with no doubt in my movie top 3. together with \"Cinema Paradiso\" which is also a masterpiece. The soundtrack is also really good. I am really curious about \"jaco von dormael's\" new movie. I hope it will complete my movie top 3. If you see this movie, rent it. Or even better. buy it. Because you will want to see it again.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "It's always nice to see Angela Bassett getting to do a role that she can really sink her teeth into. She is at times intense, funny and even sexy in her role as Lena, a \"colored\" woman forced to make a home on a desolate mudbank just outside of Cape Town, South Africa. Danny Glover is also good in a not entirely sympathetic role as her partner, Boesman. Willie Jonah gives a finely nuanced performance as the stranger that discovers Boesman and Lena's new living area. It's not often that you get a chance to see an intelligent film dealing with mature themes. Although it is based on a play, the late director John Berry (who also directed Claudine) opens the material up by having the film shot in the widescreen Cinemascope format. He also keeps things visually interesting through the creative blocking of actors and by showing us things only mentioned in the play. Just like Diahann Carroll in Claudine, John Berry may have directed Angela Bassett into an Academy Award nomination. This is definitely a film worth searching for.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "This is a film which should be seen by anybody interested in, effected by, or suffering from an eating disorder. It is an amazingly accurate and sensitive portrayal of bulimia in a teenage girl, its causes and its symptoms. The girl is played by one of the most brilliant young actresses working in cinema today, Alison Lohman, who was later so spectacular in 'Where the Truth Lies'. I would recommend that this film be shown in all schools, as you will never see a better on this subject. Alison Lohman is absolutely outstanding, and one marvels at her ability to convey the anguish of a girl suffering from this compulsive disorder. If barometers tell us the air pressure, Alison Lohman tells us the emotional pressure with the same degree of accuracy. Her emotional range is so precise, each scene could be measured microscopically for its gradations of trauma, on a scale of rising hysteria and desperation which reaches unbearable intensity. Mare Winningham is the perfect choice to play her mother, and does so with immense sympathy and a range of emotions just as finely tuned as Lohman's. Together, they make a pair of sensitive emotional oscillators vibrating in resonance with one another. This film is really an astonishing achievement, and director Katt Shea should be proud of it. The only reason for not seeing it is if you are not interested in people. But even if you like nature films best, this is after all animal behaviour at the sharp edge. Bulimia is an extreme version of how a tormented soul can destroy her own body in a frenzy of despair. And if we don't sympathise with people suffering from the depths of despair, then we are dead inside.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "Flavia(Florinda Bolkan of \"Don't Torture a Duckling\" fame)is locked away in a convent of carnal desires by her father.Tired of all of the sadism she sees around her(rape of a young woman in a pigsty,sexual cravings,horse castration)Flavia decides to run from the convent with her Jewish friend from the outside,Abraham.The two don't get very far before they are captured and then brought back to be tortured and forced to repent.After punishment she joins up with a band of Muslims called the Tarantulas,who had invaded the convent prior and leads a crusade that turns into nothing short of a bloody battle behind the convent walls.\"Flavia the Heretic\" is a well-directed and fairly notorious piece of Italian nunsploitation.The film is slightly gruesome and sleazy at times.The acting is great and the characters are well-developed.Overall,\"Flavia the Heretic\" is a genuinely moving and intelligent movie with plenty of nudity and gore.You can't go wrong with it.8 out of 10.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "Bored Londoners Henry Kendall and Joan Barry (as Fred and Emily Hill) receive an advance on an inheritance. They use the money go traveling. Their lives become more exciting as they begin relationships with exotic Betty Amann (for Mr. Kendall) and lonely Percy Marmont (for Ms. Barry). But, they remain as boring as they were before. Arguably bored director Alfred Hitchcock tries to liven up the well-titled (as quoted in the film, from Shakespeare's \"The Tempest\") \"Rich and Strange\" by ordering up some camera trickery. An opening homage to King Vidor's \"The Crowd\" is the highlight. The low point may be the couple dining on Chinese prepared cat.<br /><br />*** Rich and Strange (12/10/31) Alfred Hitchcock ~ Henry Kendall, Joan Barry, Percy Marmont, Elsie Randolph",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "Rather then long dance sequences and close ups of the characters which made the film drag on - the movie would have been better served explaining the story and motivations of the characters.<br /><br />The marginalisation of Nubo, the minister, auntie, mother - and the dumbing down of the dynamic and IMPORTANT rivalry between hatsumo and mameha and hatsumo and sayuri made the movie lack any real depth. If you hadn't read the book you would not really understand why Sayuri loved the Chairman and why Mameha became her mentor at all.<br /><br />Visually the film was stunning - and the actors all did the best with the C rate script they were given, but that was all that was good about this movie.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "If people didn't know who Barbra Streisand was before this,...(is that POSSIBLE?)...they sure knew who she was after!<br /><br />This show went on to win 5 Emmys, & stands out as one the best things Streisand has ever done.<br /><br />It's made up of 3 acts....<br /><br />ACT I...Barbra singing standards from room to room, filled with musicians, including a segment where she is a little girl again,all ending with a splendid version of her signature song,(at the time)...\"People\".<br /><br />ACT II....A musical tour of Bergdoff-Goodman,while Barbra Sings poverty songs..it's better than it sounds...<br /><br />ACT III.....The best part, Just Barbra,musicians,& some great songs,like.....\"Happy Days Are Here Again\",& a \"Funny Girl\" medley....<br /><br />all in all, a great part of television history,made by one of the greatest performers in the world!",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "I saw this film yesterday.. I rented the DVD from Blockbuster.. In fact, I know one of the actresses from the film.. I won't say who..! (That's kept under wraps..) But I must admit, it wasn't as good as I thought it would be.. Tom Savini? Hats down to this guy.. But it's a shame he wasn't in the film for long.. What lacks the film is the idea, the script, sound, etc.. It may look like a good movie.. but it wasn't that entertaining..<br /><br />Well, I'm glad my Sister paid £10 for renting 3 DVD's from Blockbuster.. I chose this one.. and I was disappointed. Anyway, thumbs down for me..! Not my cup of tea! 0 out of 10!",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "The story is about a little girl growing up in colonial Africa, but it is so much more than that.<br /><br />Anyone growing up in the South would experience the same things. A longing for another, one of a different race, that cannot be consummated. Even a glance is forbidden. There are no words needed. Their facial expressions say everything.<br /><br />It is the story of a black servant, Protée (Isaach De Bankolé) and a white woman, Aimée (Giulia Boschi). Their desire for each other is so strong that they torture each other because they cannot have each other.<br /><br />The little girl, France (Cécile Ducasse) is lonely and spends all her time with Protée. She really can't see this dance.<br /><br />One of the more irritating aspects of the film is the laziness of the colonials. They cannot even get undressed for bed by themselves. There world is about to end; they just don't know it yet. Their racist attitudes will be erased with their presence.<br /><br />I think I would like to visit this Africa. It seems so quiet; especially at night when you only hear the animals.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "**Warning! Spoilers Ahead!**<br /><br />This short is part one of two that expound upon the brief portion of \"The Matrix\" in which Morpheus explains how the matrix came to be. Because we already know the story, the plot itself is no surprise; and the short isn't so much entertaining as informative. But that's how it is presented, as a file in the historical archives. The visuals are better than average, and the generally cold colors aid the purpose of the short.<br /><br />A couple problems. The violence of the tale is a little gratuitous and, combined with the occasional dose of political correctness (UN scenes), detracts from the straight narrative of the short. Plus it needs to be seen with part two to be complete.<br /><br />The Animatrix concept is brilliant, and despite a few issues, this short still fulfills its purpose. It would not have fit in the original movie in style, content, or flow. This is the perfect method to reveal the history.<br /><br />Bottom Line: Good information. Could have been told a little better, but still a solid 7 of 10.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "...and Ethel Merman buffs, too, will love her loud, bossy vocals as the wicked witch Mombi, but this cartoon sequel to \"The Wizard Of Oz\" is bereft of real imagination, substituting fantasy and excitement with noisy action (and cheaply repeating its footage like a bad music video). Little Dorothy is whisked back to Oz, which has gone to ruin, and meets old and new friends. The inelegant animation is stuck somewhere between the weakest Walt Disney and the less-inspired shows from Hanna-Barbera, however many of the songs are good, particularly Dorothy's sweet lament \"It's a Far Away Land\", superbly performed by Liza Minnelli. You can count on Minnelli for energy, which is why the movie perks up whenever Dorothy is around. Much of it is unmemorable, and I'm not even sure baby-boomers will get a charge from it since it has been out of circulation for so long. As a curiosity item, just fair. ** from ****",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "I'm going to spend as much time on this review as the writers did on the script. This is easily THE WORST sequel EVER made.<br /><br />They KILLED Navin Johnson. Not only was Mark Blankfield's performance GOD-AWFUL, so was everyone elses!! The physical comedy was forced, flat and predictable. The script seemed to have been written by mongoloid monkeys using the pen names Ziggy Steinberg and Rocco Urbisci. How the producers managed to squeeze out such vile cinematic excrement is beyond me. They even managed to make veteran actor Ray Walston look like a talent-less buffoon. Director Michael Schultz should be ashamed of himself.<br /><br />I want the 96 minutes of my life I spent watching this befouled memory of a brilliant comedy back so I can try and convict everyone involved for this cinematic atrocity.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "This is one of the weakest soft porn film around. I can't believe somebody wrote this stupid story before making some changes. The guy Mike is a major wimp and moron I can't believe he didn't want to take a shower with his bride-to-be Toni and be in a threesome with the french photographer Jan. He does do a threesome with Toni and Kristi but that was short I hate that every time in Soft Core Porn Films threesomes between a woman, a man, and a woman is short but a girl-girl thing is about an hour. To the makers of these films have the threesomes alot longer this film should've have two threesome scenes not one but two.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "Once again, Pia Zadora, the woman who owes her entire career to her husband, proves she can't act. This disaster of a film butchers the Harold Robbins novel. Ray Liotta must have been hogtied and carried to the set to appear in this one.<br /><br />Avoid this at all costs. I doubt even doing the MST3K thing would save it.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "SPOILERS<br /><br />A buddy of mine said NEXT MOVIE was the best Cheech & Chong flick and went out of his way to have me borrow it and THE BLUES BROTHERS. NEXT MOVIE has no plot, has no pacing, really has no anything of what defines a movie ... but it is funny. And for what it is worth, Cheech and Chong show some heart.<br /><br />Well, in this little paragraph I put in the plot, but being that four-fifths of the movie, nothing happens that would usually start a story. I will just say that Cheech 's cousin shows up.<br /><br />Was there no other funnier moment when Chong made Cheech drink the pee twice? What about the rooster? Was that Pee-Wee Herman's first movie appearance? You would have to watch the movie yourself to enjoy it. I don't think NEXT MOVIE has strong enough balls to make it awesome, but the movie has heart and hey, my buddy let me borrow it so it gets a 7.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "I just saw \"If\" I can remember the advertisements for the movie from 1968, so I was interested in finally seeing it. It may be the perspective of an American who never went to a British public school and misses some of the social references, but I thought the movie was awful. For one thing, as others have pointed out, it takes almost the entire movie for the much ballyhooed-at-the-time revolt to break out. For another, whether the last scene is real or imagined, what occurs isn't a revolt, but a shooting rampage. There's quite a difference.<br /><br />I know it may be bad form to judge a movie on subsequent events, but one cannot avoid doing it here. One person wrote a message board posting asking us not to compare the end of movie to the incidents at Columbine High School and Virginia Tech. But if there's a scintilla of difference between Klebold, Harris and Cho on the one hand and Travis (Malcom McDowell) on the other, I simply can't see it. All four of them were under the delusion that their gunfire is going to purify a f___-ed up world that they arrogantly take no responsibility for.<br /><br />Which brings me to: why the hell are Travis and his chums even in a school they so despise? They are adults, or close to it. They're not in a military prison, like the inmates in \"The Hill,\" a much better British film from about the same time. No one is forcing them to go to College and take beatings from the the whips, except maybe ambitious parents in need of a wake-up about the nature of their sons. I had the opportunity in college to join a frat, except I couldn't stand to be given silly, cruel orders by delinquents claiming to be my prospective \"brothers.\" I took the consequences of not having the \"in\" with the Establishment that frats provide, and I can't say I regretted it.<br /><br />If Travis fancies himself the second coming of Lenin (whose unbearded picture hangs prominently in his room) he's free to go out and organize a fitter's union or work for Michael Foot in the next election. If he wants to be Jack Kerouac, then get on the road and start writing. What possible benefit is he giving the world in joyriding a motorcycle and getting drunk in his room?<br /><br />Sometimes reviewers have to be like the person who responded to the scene in \"Last Tango In Paris\" where Brando mopes about having had to go on a date with cow manure on his shoes. In the real world, the person said, a listener would say \"Why didn't you scrape it off? Change your shoes?\" --Don't allow fictional characters to lay a self-pity trip on you because you don't dare point out an common-sense alternative course of action for them. So it is here.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "This is one of my favorite sports movies. Dennis Quaid is moving and convincing in the part of a man who gave up his dream of being a baseball pitcher when his arm gave out on him. As a high school coach, he challenges his players to win the division championship by telling them he'll try out for a baseball team if they do. They win (partly because of all the batting practice they take with a coach who can pitch over 90 miles an hour), and he keeps his side of the bargain--and is signed! <br /><br />If you have ever decided to try something new and terrifying as an adult, Jim Morris's story will resonate with you. It is moving and inspiring, and the man's relationships ring true. <br /><br />Inspiration is not the only reason I rent this one, though. Dennis Quaid is just downright purdy in the part, and a baseball movie with a good-looking man changing a diaper is my idea of heaven. Ladies, if you feel the way I do, check this one out.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "I recently saw this at the 2009 Palm Springs International Film. This is the feature length directorial debut of veteran Dutch actress Monique van de Ven and based on my observation it should be her last. I hate movies that are so implausible that you are picking apart practically every scene. This film immediately leaves you scratching your head. as it begins a young photographer and his girlfriend who works for an international aid organization are having a leisurely drive through the Taliban-controlled mountains Afghanistan having a conversation about their love when a rocket stops a truck in front of them. They get out of their vehicle to watch as Talliban fighters equipped with rocket launchers, machine guns, rifles, handguns and grenades execute all five people in the truck. Bob (Waldemar Torenstra) starts taking pictures of all this when he is spotted by one of the insurgents who lobs a hand grenade at them that kills his girlfriend. since they are with hand throwing distance they can't be more than 50 yards away yet he somehow gets away. His girlfriend is blown up and he takes a picture of the moment of the grenade impact that kills her and wins a prize as photographer of the year for the photo. Every scene and situation in this film as as ridiculous as it's opening. The following year Bob finds himself on assignment for National Geographic on a Dutch resort island where he meets Kathleen (Sophie Hilbrand) and inserts himself into her seedy underworld of international drug smugglers. Avoid this film. I would give it a 4.0 out of 10.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "This drama is unlike Sex and the City, where the women have a few drinks and share their sexual encounters with each other. Its much more personal and people can relate to it. Its much more engaging and emotional on a new level than other dramas focusing on women and their lives like \"Sex and the City, Lipstick Jungle....\" <br /><br />Dr. Katie Roden, is a psychologist with a dark secret, she seems much more depressed and guilt ridden than the rest of her 3 friends. She is dealing with the death of her former lover who was her patient while tackling his son's advances on her. Her sombre clothes and empty and cold house convey her inside emotions very well. <br /><br />Trudi Malloy, a widow is battling issues with \"letting go\" of her dead husband from 9/11. And when a handsome stranger, Richard shows an interest in her she is suddenly forced to do a reality check by her friends who suggest that she gets back into dating business. The ridiculous and embarrassing courting scenes between Richard and Trudi are totally funny! It is interesting to note that Richard asks her out the day she gets a millions from the 9/11 board for her husband's death..lets see what his intentions are <br /><br />Siobhan Dillon, a lawyer is fed up of her husband's love making tactics which only involve \"baby making\" (as they are having trouble conceiving) and she quickly falls for her colleague who offer his \"services\" a little too willingly to her and she does not hesitate for long!It will interesting to see whether she will continue her affair or patch up with her husband (played by Raza Jeffrey) Jessica, a real estate business woman is single and is straight, until she organizes a lesbian wedding and has an affair with one of them. Her character is shown as a bold and provocative woman who before her lesbian encounter is having sex with a \"married man\", her colleague. Lets see where her character venture to....<br /><br />The beauty of this drama is that we are shown 4 totally different women with different scenarios, whose ambitions and inhibitions are shown. Its also a good thing that the drama reveals the fact that sometimes friends lie to each other to be \"safe\"!",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "\"Dahmer\" is an interesting film although I wouldn't use \"horror\" or \"thriller\" do describe it. It's more a minor character study that seems oddly sympathetic of the killer.<br /><br />Jeremy Renner portrays serial killer Jeffrey Dahmer, who drugged, murdered and dismembered his male victims. The film centers on the relationship between Dahmer and \"Rodney\", well-played by Artel Kayàru. <br /><br />Rodney is almost the more interesting character: enamored of Dahmer and having once escaped an attack, he returns to Dahmer for sex and survives a second attack.<br /><br />I think the film is disjointed because it does little to portray Dahmer's formative years, how events may have created the human monster we see on screen and offers no insight into Dahmer's belief that he could create sexual zombies of his victims.<br /><br />The roles are well played but the story is thin.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "I've seen the Gator Bait films, and this is almost exactly the same thing as those. A woman is sexually assaulted by a group of degenerate men and systematically exacts her vicious revenge on each of them. The thing that sets this movie apart from those ones (although not very far) is that the sexual content is not glorified. There is full frontal nudity many times throughout the film, but not for a second is it ever sexy. Some of the rape scenes might seem a little extensive, but that's only because the movie is trying to strengthen the audience's need to see this woman seek revenge.<br /><br />This is a weak film, it has no other way to maintain interest other than manipulating our natural desire to see this woman get revenge on her attackers. I Spit On Your Grave is not the kind of movie that you expect to deliver a serious moral, but I was glad to see that, since it contained a significant amount of violence inflicted upon the female lead, it was not meant to pass off as a T&A film.<br /><br />B-movies are notorious for being driven by nudity and out of control adolescent sexuality, and while I Spit On You Grave is unmistakably a B-movie and contains more than its share of nudity, the nudity does not drive the plot. On the other hand, the only thing that drives the plot is an empty necessity for revenge against a group of rapists. These men are evolutionary drop-outs just like they were in the Gator Bait films, and the biggest challenge for the writers seems to have been to come up with new and exciting ways to kill them, but the reason the film can never be anything more than a meaningless B-movie is because it does not deliver a message of any kind, but instead it simply satisfies the audience's desire to see a bunch of rapists get exactly what they deserve. <br /><br />The one problem that this leaves is that we have to sit through the sexual attacks. Oddly, the first half of the film is the part that contains the most nudity (although not by much), but it is by far the most painful to watch. We are even let down a little as we watch the woman obtain revenge since a couple of the deaths were so elaborate that they were obviously impossible (it seems like pure luck that the guy in the lake at the end felt such an overwhelming desire to hug the motor on the boat and press his genitalia against the propeller, staying that way while the woman yells some final words at him and pulls the cord), but again, this movie satisfies only the desire for revenge that the first half filled us with.<br /><br />(spoilers) You know that this is all the movie means to do, since it literally ends the minute the last guy is killed. The woman does not live happily ever after, she doesn't write her book, she doesn't leave and never return to that nightmare place, she just gets in the boat and motors around the lake while the movie simply stops in its tracks. But hey, what more did you expect?<br /><br />Oh, and did you read the tagline? If you decide to waste your time watching this, try and find any man getting broken or burned. I was really looking forward to those",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "This movie is one of the sleepers of all time. I gave it a 10 rating. The story is of the famed 'Bushwhackers' out of Missouri that fought on the side of the South during the War Between the States. The clothing they wore were authentic, the history and why they fought is very accurate and well researched. There was actually one of the battles that did not take place as they depicted... but not bad for Hollywood. The actors were well cast and were either the most brilliant of actors or the director really know how to get the best from them. I suspect it was a combination of great directing, super casting to find the right people and excellent performing by the actors. Not just one or two... this movie really jelled! It has action, romance, suspense, good guys and bad guys (sometimes depending on your individual perspective) and history all rolled into one movie. Even has the future Spiderman and Jewel. And she's good!",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "I too have gone thru very painful personal loss (Twice) and this movie portrays the gut wrenching reality of that experience very well, Life out of balance, nothing makes sense, well meaning relatives, etc...<br /><br />It was nice to see Ally again. She is one of my all time favorite movie actors.<br /><br />I laughed and cried as the story unfolded. Great story and cast. Well done!",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "A very well made film set in early '60s communist Yugoslavia. The five young actors who are the teenagers at the center of the story give strong, sincere and emotionally deep performances. A clear depiction of how the natural trust and naivete inherent in teens can be easily manipulated and how that impacted the rest of their lives. Highly recommended.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "When I saw the trailers I just HAD to see the film. And when I had, I kinda had a feeling that felt like unsatisfied. It was a great movie, don't get me wrong, but I think the great parts where already in the trailers, if you catch my drift. It went very fast and it rolled on, so I was never bored, and I enjoyed watching it. The humor was absolutely great. My first contact with a sloth (..or something like it).",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "\"Mr. Harvey Lights a Candle\" is anchored by a brilliant performance by Timothy Spall.<br /><br />While we can predict that his titular morose, up tight teacher will have some sort of break down or catharsis based on some deep down secret from his past, how his emotions are unveiled is surprising. Spall's range of feelings conveyed is quite moving and more than he usually gets to portray as part of the Mike Leigh repertory.<br /><br />While an expected boring school bus trip has only been used for comic purposes, such as on \"The Simpsons,\" this central situation of a visit to Salisbury Cathedral in Rhidian Brook's script is well-contained and structured for dramatic purposes, and is almost formally divided into acts.<br /><br />We're introduced to the urban British range of racially and religiously diverse kids (with their uniforms I couldn't tell if this is a \"private\" or \"public\" school), as they gather  the rapping black kids, the serious South Asians and Muslims, the white bullies and mean girls  but conveyed quite naturally and individually. The young actors, some of whom I recognized from British TV such as \"Shameless,\" were exuberant in representing the usual range of junior high social pressures. Celia Imrie puts more warmth into the supervisor's role than the martinets she usually has to play.<br /><br />A break in the trip leads to a transformative crisis for some while others remain amusingly oblivious. We think, like the teacher portrayed by Ben Miles of \"Coupling,\" that we will be spoon fed a didactic lesson about religious tolerance, but it's much more about faith in people as well as God, which is why the BBC showed it in England at Easter time and BBC America showed it in the U.S. over Christmas.<br /><br />Nathalie Press, who was also so good in \"Summer of Love,\" has a key role in Mr. Harvey's redemption that could have been played for movie-of-the-week preaching, but is touching as they reach out to each other in an unexpected way (unfortunately I saw their intense scene interrupted by commercials).<br /><br />While it is a bit heavy-handed in several times pointedly calling this road trip \"a pilgrimage,\" this quiet film was the best evocation of \"good will towards men\" than I've seen in most holiday-themed TV movies.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "Considering that this movie had a serious and quite successful launching campaign, I would have expected something to be worth the fuzz...from the opening scene on (in which the two brothers \"sensually\" caress each other, laying naked in a bed) it goes rapidly downwards...nothing to get the attention, not a mind-catching thing in the whole plot, baaad baad acting (a few minor exceptions, but artificiality is at its best). Incest and lesbianism are promising themes, but the script analyses none of the two in depth ( mind that a possible excuse of the makers, saying that they aimed for a subtle movie would be hilarious, unless subtle and superficial mean the same thing...). The too curious viewers will not get any interesting scene...at this point, that could have saved some of the movie...so you can imagine how bad it is. Many other things could be said...but please watch the movie yourselves...I am an egoist and I would like as many people as possible to waste about 1 1/2h of their lives...like I did :(",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "Elfriede Jelinek, not quite a household name yet, is a winner of the Nobel prize for literature. Her novel spawned a film that won second prize at Cannes and top prizes for the male and female leads. Am I a dinosaur in matters of aesthetic appreciation or has art become so debased that anything goes?<br /><br />'Gobble, gobble' is the favoured orthographic representation in Britain of the bubbling noise made by a turkey. In the film world a turkey is a monumental flop as measured by box office receipts or critical reception. 'Gobble, gobble' and The Piano Teacher are perfect partners.<br /><br />The embarrassing awfulness of this widely praised film cannot be overstated. It begins very badly, as if made to annoy the viewer. Credits interrupt inconsequential scenes for more than 11 minutes. We are introduced to Professor Erika Kohut, apparently the alter ego of the accoladed authoress, a stony professor of piano. She lives with her husky and domineering mum. Dad is an institutionalised madman who dies unseen during what passes for the action.<br /><br />Reviewing The Piano Teacher is difficult, beyond registering its unpleasantness. What we see in the film (and might read in the book, for all I know) is a tawdry, exploitative, nonsensical tale of an emotional pendulum that swings hither and thither without moving on.<br /><br />Erika, whose name is minimally used, is initially shown as a person with intense musical sensitivity but otherwise totally repressed. Not quite, because there's a handbags at two paces scene with her gravelly-voiced maman early on that ends with profuse apologies. If a reviewer has to (yawn) extract a leitmotif (why not use a pretentious word when a simpler one would do), Elrika's violently alternating moods would be it.<br /><br />A young hunk, Walter, studying to become a 'low voltage' engineer, whatever that is, and playing ice hockey in his few leisure moments, is also a talented pianist. He encounters Elrika at an old-fashioned recital in a luxury apartment in what may or may not be Paris. In the glib fashion of so much art, he immediately falls in love and starts to 'cherchez la femme'.<br /><br />Repressed Erika has a liking for hardcore pornography, shown briefly but graphically for a few seconds while she sniffs a tissue taken from the waste basket in the private booth where she watches.<br /><br />Walter performs a brilliant audition and is grudgingly accepted as a private student by Erika, whose teaching style is characterised by remoteness, hostility, discouragement and humiliation.<br /><br />He soon declares his love and before long pursues Erika into the Ladies where they engage in mild hanky panky and incomplete oral sex. Erika retains control over her lovesick swain. She promises to send him a letter of instruction for further pleasurable exchanges.<br /><br />In the meantime, chillingly jealous because of Walter's kindness to a nervous student who is literally having the shits before a rehearsal for some future concert, Erika fills the student's coat pocket with broken glass, causing severe lacerations to those delicate piano-playing hands.<br /><br />The next big scene (by-passing the genital self-mutilation, etc) has Walter turning up at the apartment Erika shares with her mother. Erika want to be humiliated, bound, slapped, etc. Sensible Walter is, for the moment, repulsed and marches off into the night.<br /><br />At this point there's still nearly an hour to go. The viewer can only fear the worst. Erika tracks down Walter to the skating rink where he does his ice hockey practice. They retire to a back room. Lusty Wally is unable to resist the hands tugging at his trousers. His 'baby gravy' is soon expelled with other stomach contents. Ho hum.<br /><br />Repulsed but hooked, perhaps desirous of revenge for the insult so recently barfed on the floor, Walter returns to Erika's apartment. Can you guess what happens now? It's not very deep or difficult. Yes, he becomes a brute while Erika becomes a victim. One moment he's locking maman in her room and slapping Erika, the next he's kicking her in the face, having sex with her and renewing his declarations of love. <br /><br />Am I being unfair in this summary? Watch the film if you want, but I'd advise you not to.<br /><br />Anyone can see eternity in a grain of sand if they're in the right mood. I could expatiate at the challenging depiction of human relationships conveyed by this film if I wanted. But I 'prefer not to', because this is a cheap and nasty film that appeals to base instincts and says nothing.<br /><br />I'm supposed to say that parentally repressed Erika longs for love, ineffectively seeks it in pornography, inappropriately rejects it when it literally appears, pink and throbbing, under her nose, belatedly realises that she doesn't like being hurt, blah, blah, blah.<br /><br />The world has, for reasons not explained, stunted her. She apparently makes a monster out of someone who appeared superficially loving - but surely we all know that any man is potentially a violent rapist, because that's his essential nature however much he tries to tell himself and the world otherwise.<br /><br />At the end, if you have the patience to be there, there's a small twist. Before going to the final scene, where she's due to perform as a substitute for the underwear-soiling student with the lacerated hands, Erika packs a knife in her handbag. For Walter?<br /><br />Yes, you're ahead of me. She stabs herself in a none life-threatening area and leaves. Roll credits.<br /><br />If this earned the second prize at Cannes, just how bad were the rest of the entries?",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "Overall, I enjoyed this film and would recommend it to indie film lovers.<br /><br />However, I really want to note the similarities between parts of this film and Nichols' Closer. One scene especially where Adrian Grenier's character is questioning Rosario Dawson's about her sex life while he was away is remarkably similar to the scene in Closer where Clive Owen's character is questioning Julia Roberts, although it is acted with less harshness and intensity in \"Love.\" Also note that \"Anna\" is the name of both Dawson's and Roberts' character. Can't be coincidence. Now Closer is based on Patrick Marber's play and supposedly this film is loosely based on Arthur Schnitzler's \"Reigen\" so I'm not sure how this connection formed.<br /><br />Anyone have an idea?",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "Excellent film from Thaddeus O'Sullivan featuring strong performances from a host of British and Irish actors. The film deals well with a thorny subject matter, and effectively captures the hopelessness and grim atmosphere of 1970s Belfast. Surprisingly realistic, it does nothing to glorify either side in this conflict. On one hand, it shows a young Catholic father trying to raise his family without getting drawn into the troubles. On the other it deals with a Loyalist gang who are intent on propagating violence. Very interesting and, thankfully, entertaining. Don't be expecting any laughs, though. 7 out of 10.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "I was really looking forward to seeing this film, but after watching it I was really disappointed. The best bit was when Stephen King was in it. Rober John Berk cannot act to save his life and neither can any of the others. A few of the performances even made me laugh out loud! The film was was not as I imagined it, after reading the book which was awesome, I imagined it darker and a lot scarier. If i was Stephen, I would be really mad!<br /><br />I don't know why they changed the ending, I thought the ending of the book was very good. If you just found out the pie killed your daughter, you wouldn't feed it to anyone else would you?!<br /><br />Book was so much better!",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "Ok, so it's an adult movie. But it really is very tastefully done. It's obvious that the producers spent a lot of time and money into making a classy sort of movie. I was pleasantly surprised at just how good it was. Even the acting was fairly decent. The plot was more solid than most adult films I've seen. The camera work was above average. It's just a good flick!!",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "People don't seem to be giving Lensman enough credit where its due. A few issues have been overlooked which are key to understanding the Lensman experience.<br /><br />The Year: For the year it was made in (1984) Lensman features some of the most stunning effects I've ever seen. As a person who watches a lot of early 80's animation Lensman is unique in it's use of what appears to be computer-generated imagery at a time when computers were extremely primitive. Kim's battle against the geometric cutter pods in the laser maze can be taken as an excellent example of this. Every time I watch that I have to keep repeating to myself that it was 1984 when it was made.<br /><br />The Soundtrack: Lensman has one of the most insane soundtracks that I've heard, and this mad hysterical beat permeates every corner of the film. Lensman borrowed heavily on two western mistakes and managed to somewhat deal with the first one - the need to fill in every second of silence in a film with music and the need for a heroine. While the music is attuned well and galvanizes scenes such as the motorcycle battle in the Thionite Factory on Radelyx, the heroine theme fails due to the sheer annoyance value of Chris. It's interesting to note that the constant music thwarted my attempts at noise removal when I was archiving lensman over from analog tape to digital format - since there wasn't a single second of silence available to use as a reference point.<br /><br />Western Influences: Helmut - sounds like \"helmet\" and has roughly the same voice as Darth Vader. Clarissa Fairborn - has the same hairstyle as the princess of SW and her name sounds suspiciously similar to Marissa Fairborn of Transformers. Takes over Han Solos role by flying the ship and having some technical expertise. Buzzkirk - a definite improvement on Chewbaka. The lens - a nice concrete copy of the force that comes across less as a chance to preach Christianity at the audience than in the original SW. While the force relied on belief far more than concentration, the lens is a pure concentration tool. Theoretically, anyone could wield the lens. The lens is far more limited than the Force - being purely a defensive/offensive weapon.<br /><br />Technology: The boskone alliance have interesting meatball sponge ships. They look like stormtroopers only with red uniforms instead of white. The idea of a DNA weapon was nice if only it had been developed. The Galactic Alliance looked like Starblazers (or whatever it was called - that 60's series where they were battling the Xylons). There weren't enough ship to ship battles for me - this is much improved upon in the second Lensman film.<br /><br />Finally a note on Worzel. This character is a unique and very interesting character-design who fortunately continues on to the second film.<br /><br />",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "A strong pilot, this two-hour episode does an excellent job of setting up the characters and background for \"Enterprise,\" the \"prequel\" to the original \"Star Trek\" series. It stumbles a few times into \"Trek\" convention and cliché--candy-colored space strippers never seem to go out of style, and I can already foresee snickering references to T'pol as \"Seven of Vulcan\"--but the ensemble looks strong, the characters are well-drawn, and one can already see hints that this particular crew will have to be more resourceful, in different ways, than those of earlier (later?) series. Scott Bakula hits the right note as a captain with Kirk's brashness and daring but without his smugness and swagger, and I look forward to the ways in which the series will feature the engineer, weapons master and communications officer (not just a glorified phone operator anymore!) as supporting players. The writers seem to have picked up on the one big mistake made in \"Star Trek: The Next Generation,\" \"Deep Space 9\" and \"Voyager\": Instead of starting with a big ensemble cast and giving characters short shrift, it's starting with a smaller core of characters to which a little more variety can be added later--which I hope happens, because after about a half-dozen episodes, more variety will be needed.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "I cannot say this movie is a disappointment because I read some reviews before watching and it did not do as well as I thought it would have. The bar was not set that high, so the fact that my expectations were met is not saying much.<br /><br />The Good: The city of New York. If you live in the city like me, you'll recognize certain places and understand that the city is supposed to be more than just a setting, rather one of the main characters. There are genuinely tender moments, humorous conversations, and plot twists left and right which all keep things interesting.<br /><br />The Bad: The first thing I thought after leaving the theater was that I wanted more, but not in the positive \"leave them wanting more\" fashion. Certainly the good skits/scenes outweigh the bad, but there are a lot of skits that fall within the \"in-between\" category, too many in fact, which is what ultimately brings the movie down. Also, New York City's diversity, though hinted at though the many distant pans of the city and mentioned in conversation throughout the movie, is never really realized or analyzed to the point of doing the city justice. For example, many of the skits involve well to do middle aged whites. I mean I know the city is home to many of the said demographic but come on, Paris Je'taime's plot and character diversity makes New York City look like Lancaster, PA, or someplace really white. It is just disappointing to see the city shortchanged on its heritage like that.<br /><br />Still, even after having said this, I would recommend giving New York, I Love You a view. Who knows, maybe you'll disagree with my opinion and maybe you won't. You will never know until you see it for yourself. This review is not meant to deter anyone from watching this movie, as everyone's opinion on art differs. I'm just giving you a very vague heads up on what to expect.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "Interesting characters, lots of tension. As close to black and white without being black and white. I was turned off by how casually the supposedly sympathetic mainstream character, a quiet, near deaf secretary, was able to turn to crime to ruin colleagues, rough up people in her way and finally participate in a heist, and set up someone to be bumped off as a decoy to her own get-away. I'm a little put off by the trend for otherwise quality movies to portray criminals in a sympathetic way without addressing the injury they've done to others other than to portray their immediate opponents as jerks. In this film we never know who's money it really is they abscond with, or what happens to the innocent wife who the sympathetic deaf-secretary uses to set up the of the sleazy bar owner to take the fall for the missing loot. Too bad, the film could have been great.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "I loves this movie,because it showed that they were not killing for fun but to save the ones they loved! Heath Ledger and Orlando Bloom did a great job portraying Ned and Joe. It has a few quick inappropriate scenes but is all right other than that. The language is very mild and sometimes don't even know it is there. This movie shows that just because they are outlaws does not mean that they are vicious killers! I hope that people will watch this movie and learn about important times in history like this one. There is one thing that fascinates me about this movie is that they got their inspiration for their armor from a book Ned looked at! Also that that is how people remember them,from their armor. I hope that people will watch this movie and get interested as I have.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "This has to be the cheapest film made in 21st century. It is all the way low quality, but at the end it falls below... everything. All the cheap tricks - like flashing and darkness - are used to hide those crappy computer effects.<br /><br />All the actors are below average, especially the main character Anne Fletcher (Simmone Mackinnon). There is a scene, where Anne is asked: \"Why you seem so careless?\" The correct answer is, because she can't act. No matter what happens (the world is about to be destroyed, her friend is dying, she is fired), she has the same stupid grin in her face.<br /><br />It is not only the movie, which is B -quality. It is also the back cover description (at least in Finland). The text mentions things like Lorica Gray -vessel, Capital -vessel and main character Garrison Harper and Anna (not Anne) Fletcher. The description sounds like a different movie, both featuring character called Fletcher and sea monsters",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "This movie stinks! You will want back the two-plus hours it takes to get through it. Sliding Doors, w/ Gwyenth Paltrow and directed by Peter Howit, did what Melinda & Melinda tries to do much much MUCH better. That movie was clever, witty, and well-acted. I cared about what happened to both Gwyenths -- or rather the characters she played -- and the performances by supporting cast were fantastic.<br /><br />Where as Melinda & Melinda is tiresome, the dialogue is contrived and I could have cared less about any of these people -- least of all Melinda. One Melinda is so dysfunctional -- her first glass of wine is at 10 a.m. -- and so melodramatic she is laughable, and not in the comedic sense. The 2nd Melinda is fine, but forgettable.<br /><br />Woody Allen's previous ensemble movies worked because, I'm guessing, he spent time on the screenplay and the actors were talented. One piece of trivia for this movie is that he wrote this screenplay in two months: you can tell. And while Chloe Sevigny is talented -- those around her are not, not enough to be a whole presence. The movie ends up being Chloe Sevigny and a bunch of other people you know you've seen in other movies but can't quite remember which ones.<br /><br />Sad, very sad.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "I rented this film purely on the fact that the cover appealed to me. However as soon as the film began I had regrets. It seems they used a home video camera to shoot this film and let a young child do it. They also used inappropriate ghostly faces and shapes to try and scare people but i found myself laughing, i could have put that together myself and done a better job of it.<br /><br />As for the plot I felt that it had some really good ideas but because of dodgy lines and in some cases acting they were overshadowed. It had no direction.<br /><br />I didn't want to sit through it all because it caused me physical pain to watch it but i always finish what i start so i took a deep breath and let it carry on. Definitely 98minutes of my life wasted.<br /><br />I would save yourself the embarrassment of knowing that you have watched 'Haunted Boat' and find something that is more entertaining. I'm a fan of low budget horror films but this was a major disappointment i thought nothing could get worse after 'Terror Toons' but this made me reconsider. A let down to its genre.<br /><br />* out of ***** (The star is for the ideas of having their worst fears coming for them)",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "But if you like the muppets I defy you to dislike this one. Basically the same plot regurgitated (this time New York, not LA) it features a lot of fun cameos and muppet hi-jinx. A lot of the muppets leave the film pretty early on as it centers around Kermy and Miss Piggy. I happened to have enjoyed it greatly. Fun to watch with your kids.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "A lovely little B picture with all the usual Joe Lewis touches.... people ripping up pillows and auras of lurking fear. Also, alas, an ending that comes out of nowhere, because, apparently, the auteur has lost interest in the movie, or perhaps because as a B picture it has to fit into a slot.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "I saw this kung fu movie when I was a kid, and I thought it was so cool! Now I am 26 years old, and my friend has it on DVD!!!<br /><br />We got a case of brew, and watched this classic! It lost NONE of it's original kung fu coolness! If you are a fan of kung fu/karate movies, this is a must see... the DVD is available. I believe this movie is also called \"Pick Your Poison\".<br /><br />Watch it soon!",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "I've been intrigued by this film for a while, in part because of the extremely high score here on IMDb -- a 9.0 average with over 300 votes gives it the highest rating of any accessible silent film! How had I not heard of this film before this website? Well, you can't always trust the ratings. This is actually a very good film, preserved quite well if the fine VHS transfer I rented is any indication -- excellent acting by the principals, especially William Haines as Brown, and good location work at Cambridge with some fine action footage in the climactic Harvard/Yale football game -- but the story must have seemed a hoary chestnut even in 1926. Obnoxious, self-centered and charismatic guy goes to school and gets put in his place, becoming in the process a caring, self-sacrificing friend; I doubt people in 1926 found much that was really exciting in the last few reels, the predictability factor is high. Still, it starts out very well, and is certainly deserving of being remembered, if not praised to the heavens. Maybe the previous 350 voters are mostly Harvard men...<br /><br />EDIT Now 600+ voters and the score has actually climbed to 9.2! Seriously, folks, there is ballot-stuffing going on here - I defy anybody to explain why this is a better film than \"Metropolis\" or \"The General\"!",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "Ella was excellent, Franchot was unavoidably over-the-top (But he played similar parts in other films such as \"The Man on the Eiffel Tower\") and Alan was nearly non-existent but the film certainly \"thrilled\".<br /><br />*mild spoiler ahead*: I wonder how many times Elisha Cook got strangled in his films but I seem to recall various other examples. I will avoid naming the murderer but I think it's necessarily obvious because of the plot \"thriller\" demands.<br /><br />A very well-done but dated film noire (for example: everyone smoked like crazy and the police were really stock characters. And no dead bodies were ever shown, unlike today's gore fests.) done in the familiar short-scene tableaux format of the period.<br /><br />8 out of 10.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "Rarely have I witnessed such a gratuitous waste of talent. There is almost nothing constructive to be said about this hopeless swamp of a film. What few interesting strands the film seems to promise initially turn out to be little more than red herrings. Actors of stature - Robert Duvall, Robert Downey, Jr. - are deployed in roles which go nowhere; a director of occasional genius produces a film which looks like it is filmed through a coffee-stained camera lens; a writer (John Grisham) who has never produced anything of merit, discovers new depths of under-motivated incoherence. The film has a cheap, lecherous feel about it - but barely at the level of commentary - its really part of the aesthetic. Normally, I come on to the IMDb to write balanced, generally appreciative comments. This egregious disaster of a film just makes me want to produce an endless, bilious rant. I won't, but only because I no longer want to occupy my \"mind\" with this trash.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "The Secret of Kells is a film I've been waiting for for years after seeing some early footage at the Cartoon Saloon in Kilkenny. I'm here to tell you now it's been worth the wait. The cartoons are heavily stylised but not annoyingly so as I'd feared. The whole film is a thing of beauty and great imagination, I particularly love the animated illuminated book where the little figures come to life on the page. The characterisation is superb, I love Brendan Gleeson's voice as the stern Abbot and I especially liked the voice of the sprite Aisling. The forest is a triumph, such a beautiful place. The story is well realised, a mix of fact and fantasy. and really draws the viewer in to cheer on Brendan in his quest for the perfect materials for the Book. I'm a lover of calligraphy and illumination anyway so the subject is close to my heart, but all the people I know who've seen this and are not fans of the craft agree that it's a lovely little film. I will definitely buy the DVD when it's released, and would like to say, well done Cartoon Saloon and all the people involved in this mammoth project. May there be many more. :) Coming back in here to say that I bought several copies of the DVD as soon as I could and gave them out at Christmas, everyone loves it! And I wish them all the luck in the world at the Oscars, such a joy to see this nominated.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "this was the best bonnie and clyde movie i have seen. it has more accurate accounts of what happened and while it doesnt glorify their crimes it casts the pair in a normal light. i give this movie a 10. it has great actors,realistic scenes and excellent writers.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "Much has been made of Rohmer's use of digital technology to 'fill in' the background. At times it works well, the scene where Grace and her maid witness from afar the King's execution is particularly striking. At other times it gives the film a strangely amateurish look, resembling a home video. However, the major failing is that the sheer artificiality of the mise en scene creates an alienating effect in the viewer. We know that what we are watching is not real so how can we feel for the characters? To be frank, I did not care at all what happened to the Lady or the Duke.<br /><br />The other major failing, I regret to say, is the performance of Lucy Russell in the leading role. She is in virtually every scene and the success or otherwise of the film rests on her performance. OK she is speaking a foreign language but she is incapable of expressing real emotion. Her emoting in the scene where she recounts to her friend Mme de Meyler (an excellent performance by the debutante Helena Dubiel) seeing the head on a pole caused some embarrassed laughter in the audience. Also, watch her hands when she is expressing emotion!<br /><br />All in all a very disappointing film, particularly given the positive reviews on this site.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "Big Bad Ralph is also on the not so squeazy truck commercials, and can be found at numerous brothels around Melbourne any given night.<br /><br />Terrible Film by the way, wasn't shocking just bad, uninteresting<br /><br />The main guy was in charge of the metal section on countdown , and was the lead bouncer at a gay night club in Melbourne.<br /><br />I dunno who the women where? probably pros's that Ralph knew?<br /><br />No story of interest, its one of those fast forward jobs<br /><br />Please look up Big Bad Ralph at brothels around Melbourne<br /><br />hes famous in them.<br /><br />i wish i could give 0/10 but ill give it 1. Only cos i cant give 0",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "I thought that the nadir of horror film making had been reached with \"Book of Shadows\", I was wrong. This film makes that look like \"The Magnficiant Ambersons\" compared to this piece of shameless, unexpurgated fecal matter that has the audacity to call itself a movie. I'd write more but I'm still to angry that I was idiot enough to spend £3 renting it, bobbins.<br /><br />And were these people English? and where is the forest> I have lived in the UK two thirds of my life and as far as I know there are no dark uncharted woodlands in the midlands. The whole bally thing looked like a national trust conifer plantation. Those angels looked like anorexic pornstars (turned most of them were, did my research). I did however like the bit when Judd got ripped in pieces.<br /><br />P.S I love and admire Tom Savini but HE CANNOT ACT",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "Now, I've seen a lot of bad movies. I like bad movies. Especially bad action movies. I've seen (and enjoyed) all of Jean-Claude Van Damme's movies, including the one where he's his own clone, both of the ones where he plays twins, and all three where he's a cyborg. I actually own the one where he plays a fashion designer and has a fight in a truck full of durians. (Hey, if nothing else, he's got a great ass and you almost always get to see it. With DVD, you can even pause and zoom in!) That's why you can trust me when I say that this movie is so bad, it makes Plan 9 look like Citizen Kane.<br /><br />Everything about Snake Eater is bad. The plot is bad. The script is bad. The sets are bad. The fights are bad. The stunts are bad. The FX are bad. The acting is spectacularly, earth-time-bendingly bad, very probably showcasing the worst performance of every so-called actor in the cast, including Lorenzo Lamas, and that's really saying something. And I'd be willing to bet everyone involved with this movie is lousy in bed, to boot. ESPECIALLY Lorenzo Lamas. <br /><br />It does manage to be unintentionally funny, so it's not a total loss. However, I recommend that you watch this movie only if you are either a congenital idiot or very, very stoned. I was able to sit through it myself because I needed to watch something to distract me from rinsing cat urine out of my laundry.<br /><br />It didn't help much, but it was better than nothing. One point for Ron Palillo's cameo as a gay arsonist.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "If there was anything Akira Kurosawa did wrong in making Dodes'ka-den, it was making it with the partnership he formed with the \"four knights\" (the other three being Kobayaski, Ichikawa, and Konishita). They wanted a big blockbuster hit to kick off their partnership, and instead Kurosawa, arguably the head cheese of the group, delivered an abstract, humanist art film with characters living in a decimated slum that had many of its characters face dark tragedies. Had he made it on a more independent basis or went to another studio who knows, but it was because of this, among some other financial and creative woes, that also contributed to his suicide attempt in 1971. And yet, at the end of the day, as an artist Kurosawa didn't stop delivering what he's infamous for with his dramas: the strengths of the human spirit in the face of adversity. That its backdrop is a little more unusual than most shouldn't be ignored, but it's not at all a fault of Kurosawa's.<br /><br />The material in Dodes'ka-den is absorbing, but not in ways that one usually finds from the director, and mostly because it is driven by character instead of plot. There's things that happen to these people, and Kurosawa's challenge here is to interweave them into a cohesive whole. The character who starts off in the picture, oddly enough (though thankfully as there's not much room for him to grow), is Rokkuchan, a brain damaged man-child who goes around all day making train sounds (the 'clickety-clack' of the title), only sometimes stopping to pray for his mother. But then we branch off: there's the father and son, the latter who scrounges restaurants for food and the former who goes on and on with site-specific descriptions of his dream house; an older man has the look of death to him, and we learn later on he's lost a lot more than he'll tell most people, including a woman who has a past with him; a shy, quiet woman who works in servitude to her adoptive father (or uncle, I'm not sure), who rapes her; and a meek guy in a suit who has a constant facial tick and a big mean wife- to those who are social around.<br /><br />There are also little markers of people around these characters, like two drunks who keep stumbling around every night, like clockwork, putting big demands on their spouses, sometimes (unintentionally) swapping them! And there's the kind sake salesman on the bike who has a sweet but strange connection with the shy quiet woman. And of course there's a group of gossiping ladies who squat around a watering hole in the middle of the slum, not having anything too nice to say about anyone unless it's about something erotic with a guy. First to note with all of this is how Kurosawa sets the picture; it's a little post-apocalyptic, looking not of any particular time or place (that is until in a couple of shots we see modern cars and streets). It's a marginalized society, but the concerns of these people are, however in tragic scope, meant to be deconstructed through dramatic force. Like Bergman, Kurosawa is out to dissect the shattered emotions of people, with one scene in particular when the deathly-looking man who has hollow, sorrowful eyes, sits ripping cloth in silence as a woman goes along with it.<br /><br />Sometimes there's charm, and even some laughs, to be had with these people. I even enjoyed, maybe ironically, the little moments with Rokkuchan (specifically with Kurosawa's cameo as a painter in the street), or the awkward silences with the man with the facial tics. But while Kurosawa allows his actors some room to improvise, his camera movements still remain as they've always been- patient but alert, with wide compositions and claustrophobic shots, painterly visions and faces sometimes with the stylization of a silent drama meant as a weeper. Amid these sometimes bizarre and touching stories, with some of them (i.e. the father and son in the car) especially sad, Kurosawa lights his film and designs the color scheme as his first one in Eastmancolor like it's one of his paintings. Lush, sprawling, spilling at times over the seams but always with some control, this place is not necessarily \"lighter\"; it's like the abstract has come full-throttle into the scene, where things look vibrant but are much darker underneath. It's a brilliant, tricky double-edged sword that allows for the dream-like intonations with such heavy duty drama.<br /><br />With a sweet 'movie' score Toru Takemitsu (also responsible for Ran), and some excellent performances from the actors, and a few indelible scenes in a whole fantastic career, Dodes'ka-den is in its own way a minor work from the director, but nonetheless near perfect on its own terms, which as with many Kurosawa dramas like Ikiru and Red Beard holds hard truths on the human condition without too much sentimentality.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "First of all, I liked very much the central idea of locating the '' intruders'', Others in the fragile Self, on various levels - mainly subconscious but sometimes more allegorical. In fact the intruders are omnipresent throughout the film : in the Swiss-French border where the pretagonist leads secluded life; in the his recurring daydream and nightmare; inside his ailing body after heart transplantation.... In the last half of the film, he becomes intruder himself, returning in ancient french colony in the hope of atoning for the past. <br /><br />The overall tone is bitter rather than pathetic, full of regrets and guilts, sense of failure being more or less dominant. This is a quite grim picture of an old age, ostensibly self-dependent but hopelessly void and lonely inside. The directer composes the images more to convey passing sensations of anxiety and desire than any explicit meanings. Some of them are mesmerizing, not devoid of humor though, kind of absurdist play only somnambulist can visualize.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "For quite a long time in my life, I either did not like this film, or I liked this film but not as much as many more. I watched it recently (at a sleepover, funnily enough) and I liked it more than I had done since I was under 6 or something. I now appreciate it more, as I do with a few other Disney classics that I have watched recently (including \"Sleeping Beauty\" and \"Pinnochio\" or however you spell it). <br /><br />I now very much appreciate the animation, the clever \"Disney\" plot turns, the humour from the mice, the emotions expressed and the plot. The animation is very well done, often it seems you are wherever the other characters are, watching them. The animation also does well portraying the styles of the backgrounds, including the town (which is shown twice briefly). Disney changes this from the original fairy tale in a surprisingly good way, injecting clever plot turns ,such as the mice making the clothes and the key part (usually I do not like Disney films very much if they are not that similar to the original story, but with this I am not overly bothered. I feel they made necessary changes to make this a good Disney film. Often I do not think Disney changed the book in a good way in some of their films). <br /><br />You know the story already, Cinderella is a girl working for her horrible stepmother and stepsisters. She goes to a ball with the help of her fairy godmother and loses a glass slipper...<br /><br />This is a film very much to be watched with other people. Immediate family is not good enough. To enjoy this, I recommend you watch it with friends (and immediate family, if you like. :-) ). <br /><br />I recommend this to people who like Disney at least a little bit, people who like fairy tales and for people who like mice. Enjoy! :-)",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "The quintessential road movie...if your idea of a road movie involves three would-be magicians with Eastern European accents and Claire Forlani. (Well, one out of four ain't bad...) A no-talent magician with an eye for showmanship (Max) watches a very skilled pickpocket (Hugo) plying his trade in New York. After convincing Hugo that he (Max) is a) mental and b) desperately in need of a partner to make his dreams of being a stage magician come alive, the not-so-dynamic duo enlist the managerial expertise of an inventor of illusions (Milo) and the, ah, gentler attributes of a lovely waitress (Lydia). The unlikely four pile into a van (obtained by Hugo...you guess where it came from) and head to Vegas. Havoc ensues. Anyhow, it's funny, it's well-written, and the ending is surprisingly good. A solid comedy with a warm heart, and all the better that it was totally unexpected.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "Not on the same level as Ring (or Ring 2) but still a good Japanese horror flick nonetheless. I wish North American horror producers would take a page out of the Japanese horror template and put more 'spookiness' and less cheap shocks in their flicks. Lots of good examples in this one, scenes where a whited out face is scene staring behind a young actress, photographs on a wall are suddenly glimpsed smiling, just for a second, and more. Worth checking out if you like the genre.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "Shinjuku Triad Society: Chinese Mafia Wars is unlikely to get distribution in the West outside film festivals. Why? Could your censors stomach a film where policemen anally rape male and female suspects to get them to talk (and the victims enjoy it) or see an old lady have her eye torn out of her skull? These are just a few of the shocks in store for viewers of this ultraviolent cops and gangsters story. It makes Clockwork Orange which was banned for years in the UK look like a Disney cartoon.<br /><br />Should you see this film? YES It is fantastic and essential viewing for fans of Asian cinema. The shocking moments are there to illustrate what goers on in the world of these characters. If you like this make sure you catch Dead or Alive which is very similar (barring the insane ending in DOA of course). Great for Japan that they have a talent like Miike working at the same time as Takeshi Kitano. The best chance of seeing this film outside a Takashi Miike retrospective at a film festival is on DVD. If I haven't put you off try hunting for a Hong Kong version on the web as I'm sure it will come out in that country.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "En route to a small town that lays way off the beaten track (but which looks suspiciously close to a freeway), a female reporter runs into a strange hitch-hiker who agrees to help direct her to her destination. The strange man then recounts a pair of gruesome tales connected to the area: in the first story, an adulterous couple plot to kill the woman's husband, but eventually suffer a far worse fate themselves when they are attacked by a zombie; and in the second story, a group of campers have their vacation cut short when an undead outlaw takes umbrage at having his grave peed on.<br /><br />The Zombie Chronicles is an attempt by writer Garrett Clancy and director Brad Sykes at making a zombie themed anthologya nice idea, but with only two stories, it falls woefully short. And that's not the only way in which this low budget gore flick fails to deliver: the acting is lousy (with Joe Haggerty, as the tale-telling Ebenezer Jackson, giving one of the strangest performances I have ever seen); the locations are uninspired; the script is dreary; there's a sex scene with zero nudity; and the ending.... well, that beggars belief.<br /><br />To be fair, some of Sykes' creative camera-work is effective (although the gimmicky technique employed as characters run through the woods is a tad overused) and Joe Castro's cheapo gore is enthusiastic: an ear is bitten off, eyeballs are plucked out, a face is removed, brains are squished, and there is a messy decapitation. These positives just about make the film bearable, but be warned, The Zombie Chronicles ain't a stroll in the park, even for seasoned viewers of z-grade trash.<br /><br />I give The Zombie Chronicles 2/10, but generously raise my rating to 3 since I didn't get to view the film with the benefit of 3D (although I have a sneaking suspicion that an extra dimension wouldn't have made that much of a difference).",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "The first Cube movie was an art movie. It set up a world in which all the major archetypes of mankind were represented, and showed how they struggled to make sense of a hostile world that they couldn't understand. It was, on the non-literal level, a \"man vs. cruel nature\" plot, where the individual who represented innocence and goodness came through in the end, triumphing to face a new, indefinable world beyond man's petty squabbles; a world where there were no more struggle, but peace. I rated Cube a 10 out of 10, and it's a movie that was never meant to have any sequels.<br /><br />The second movie, Hypercube was a massive disappointment. Some of the ideas were kind of cool, but in the context of the original movie, both the story and the setting made no sense and had no meaning. Still, for being fairly entertaining, I rated it a 5 out of 10.<br /><br />The third movie, Cube Zero, while ignoring the second, plays like a vastly inferior commercial B-movie rehash of the first, sans the symbolism. There is no \"homage\" or \"tribute\" here; there is only ripping off. The same kind of plot, with some elements idiotically altered (like having letters instead of prime numbers between the cubes - an idea which shows more clearly than anything else that this is a rip-off with absolutely no originality and nothing to say).<br /><br />That we see something from \"behind the scenes\" means nothing, because the watchers are just part of the Big Bad Experiment, the architects of which we hear nothing of. And, in this movie, those who get through to the exit (like Kazan did at the end of the first movie) are just killed - where the *bleep* is the sense in that?! That's just flippin' stupid. I'm glad I didn't pay to see this.<br /><br />The production values and acting in Cube Zero are not too bad, but the story and the ideas are so utterly devoid of any inspiration that this movie can only get from me a rating of 3 out of 10.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "\"Rock 'n' Roll High School\" will probably have to go down in history as the ultimate rebellious party flick. Portraying a bunch of high school students using the Ramones' music as inspiration to rise up against their despotic principal (Mary Woronov, of \"Eating Raoul\" fame), the whole movie is a mile a minute. It's basically a big excuse to have fun, and I'm sure that you will. Bullied freshmen? Check. A dorky music teacher (Paul Bartel, also from \"Eating Raoul\"*)? Check. Exploding mice? Checkmate.<br /><br />Anyway, this is the sort of stuff that makes life worth living. Even for someone like me who doesn't know the Ramones' music, it's pure pleasure. With Roger Corman executive producing and Joe Dante co-directing, how could we expect anything less? Too bad that director Allan Arkush later degenerated into fare such as \"Caddyshack II\".<br /><br />Also starring P.J. Soles, Vincent Van Patten, Clint Howard, Dey Young, Dick Miller (who has appeared in every one of Joe Dante's movies, and many of Roger Corman's), Don Steele, and of course the Ramones. A real treat.<br /><br />*It seems like Bartel and Woronov always co-starred. They also co-starred in Joe Dante's \"Hollywood Boulevard\" and the slasher flick \"Chopping Mall\" (also starring Dick Miller)...in which they reprised their roles from \"Eating Raoul\".",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "Poorly written conspiracy drama/mystery about the possibility that AIDS was introduced to the public by the government. Wlaschiha plays a gay researcher looking for answers--that within this foggy plot would be hard for anyone to find. Despite the cinematography itself being commendable, the camera hungers for characters of true depth instead of the shallow, amateur acting it unfortunately has to convey. Grade: D+",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "There's nothing really to dislike about \"The Odd Couple,\" and it's no surprise that Jack Lemmon and Walter Matthau make a hugely winning comedic team. But there's something so underdeveloped about Neil Simon's adaptation of his hit stage play as to make it seem more like a skit on a sketch comedy show than a full-bodied film. I have not seen the play, but have to assume that the screen version is fairly faithful, since Simon wrote it, so the defects cannot be blamed on a stage-to-screen adaptation. There are some interesting ideas in this story--two recently divorced men who fall immediately into traditional married roles when they become roommates because neither knows any differently--that Simon never fully fleshes out. Still, there are many worse ways to kill a couple of hours.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "In the future of 1985, a governmental committee headed by Howard Hesseman, is holding hearings on TV's first uncensored network. They sample it's programming, that play as a series of skits. I can name the good 'skit' movies on one hand, not using my thumb. \"Amazon Women on the Moon\", \"Kentucky Fried Movie\", \"The Meaning of Life\", and \"Mr. Mike's Mondo Video\". Notice how I didn't mention \"Tunnel Vision\"? The reason for that is that this 'movie' is death in cinematic form. None of the skits are even remotely funny, or even the least bit clever. It takes some sort of great ineptitude on the film makers' part to not even get one laugh out of me.<br /><br />My Grade: F <br /><br />Eye Candy: Dody Dorn goes full frontal",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "here, let me wave my hands over the keyboard, i'll tell you what salad she's going to order. over and over, works like a charm: he's such a genius, omg how does he do it? my bullshit detector freaks if i even pass this show when i'm scanning channels, I have to be very careful (these days it's useful far too often, so I don't need it getting broken on idiotic crap like this...careful with that remote!). is this supposed to be some fascist propaganda to make people believe in some invisible realm of uberman control and mastery? or what? why does it exist??<br /><br />this is THE most inane show, completely unbelievable and contrived, and I cannot understand why it's still on the air. so may geeks give SO much better shows such a hard time (Sarah Connor Chronicles, True Blood), but give this nonsensical drivel a pass. shows like Firefly (if there were any like that) fall away after a season, but mindless stuff like this that makes zero logical sense just keeps marching on. yeccch.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "Having read another review, I thought this movie would actually be good. I do enjoy the \"B\" movies, but this couldn't even be classed as such. The photography is probably the only half-way decent thing in the movie. But the editing left much to be desired. It was very choppy and staccato. Whoever chose the music and sound did a terrible job. The music was awful, specially anything atmospheric or scene setting. If the acting had been better, they could have pulled the movie off. Unfortunately, I've seen better acting in porn flicks. If you want to see a \"B\" vampire movie, check out 'Blood Ties'. You'll be much more entertained.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "This movie was great and I would like to buy it.The boy goes with his grandfather to catch a young eagle. the boy has to feed and care for the eagle until it is old enough to be sacrificed for the crops. the boy saves the eagle from being killed and runs away from the tribe.The eagle helps feed him by catching a duck from a small pond the boy scares up. Later the boy shoots a deer that a bully kid was claiming because their arrows were marked very close the same. Only until they check the thickness of the red lines do they determine who actually got the deer. But this was unfortunate because it made the other boys even crueler to him,and at the end he is being chased up onto a cliff but when you think he will fall off his pure love for the eagle transforms him into a golden eagle with only a necklace as a reminder of who he was.Please if anyone knows where I can buy this movie let me know.I haven't seen it for over 30 years,but still remember parts of the movie.deniselacey2000@yahoo.com",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "Having been driven out of the house and into the theater by the sweltering heat, I could not have been more pleased. The Road to Perdition, directed by Sam Mendes (American Beauty), is destined to become one of the greatest movies of all time. Perhaps I'm just getting old; perhaps I've just seen the same themes recycled time and again. But this movie is indeed different.<br /><br />The story opens with young Michael Sullivan Jr. facing out to the sea, contemplating the duality of his father's legacy -- one of the best men to ever live, one of the most evil. This duality snakes its way throughout the movie. The story revolves around crime boss John Rooney (Paul Newman) and Michael Sullivan (Tom Hanks), the young man Rooney once took in and who now serves as his personal \"Angel of Death.\" Rooney is tied by blood to his own son, but tied by love and loyalty to Michael. Young Michael Jr., intrigued by the stories he reads, steals away in his father's car one night while Dad goes off to \"work\" with Connor Rooney, heir to the family \"business.\" Connor lets the situation get out of hand, and what was meant only to be a warning turns into murder -- witnessed by Michael Jr. Upon the discovery that young Michael has seen what he should not have seen, the plot is set in motion as conflicting loyalties collide. Soon, Michael Sr. is on the run with his young son, pursued by contract killer Harlen \"The Reporter\" Maguire (Jude Law).<br /><br />I will disclose no further details in order to avoid any potential spoilers. However, I strongly encourage viewers to examine the many dualities that present themselves in the movie: Problems between sons and fathers (Michael Sr & Jr., John Rooney & son Connor), between the world at home and the world at \"work\", between good and evil, between those who pretend to be men of god and those who really are, between \"clean\" money and \"dirty\", between the town of Perdition and Perdition as hell. And along the way, savor the visual brilliance of cinematographer Conrad L. Hall (9 nominations, 2 oscars for best cinematography): rain pouring off fedoras, shots through mirrors (especially on swinging doors), tommy-gun flashes from out of the shadows, absent any sound. Not only has 75-year-old Hall given us perhaps the best cinematic product of his career, but 77-year-old Paul Newman offers one of his best performances ever.<br /><br />Yes ... I may be getting old. But I've seen a lot ... and this is fresh and invigorating. The Road to Perdition presents a lasting and loving tribute to the gangster genre, to films of the 40s, to dark comic-book figures lurking in the darkness, to villains and heroes, to American film in general. Go see it!",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "This is definitely the worst bigfoot movie I've ever seen and quite possibly the overall worst movie I've ever seen in my life. The actors and actresses were horrible and it seemed like they were trying way too hard to play their roles as dorks, tough guys, jerks, know it alls, etc. And the bigfoot itself was terrible. It appeared to be some kind of computer generated image from the days of Atari & Intellivision. At one point near the end of the movie as an army of sasquatches were chasing after the remaining survivors, one gets shot and as it's running it looked like a poor man's version of donkey kong himself! And one gets hit by a bullet and the blood that comes out of it was just awful animation. Another thing that was annoying was the music. Way way way too much music (classical score or whatever you call it) throughout the entire film. It was never ending. Oh yeah, the movie is boring too. Absolutely one of the worst films I've ever seen. I highly recommend taking your $3 or whatever they charge to rent this movie and spending it on a gallon of gas or a value menu somewhere. TRULY AWFUL!",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "This really is the most dreadful film I have ever seen. I simply have no idea how anyone has the audacity to put this on release.<br /><br />The production standards are atrocious. There is no pretence here at cinematography. The camera work, scripting, acting and sound are unbelievably crass. I think there is a plot, but it could have been done in 10 minutes sparing us the time to watch it. The hysterical neurotic girls at the centre of this piece have no credibility whatsoever.<br /><br />I would urge anyone to avoid spending any time or money on this Title. It is truly atrocious.<br /><br />JDD - 14 December 2008",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "This was a silly movie with a predictable storyline and dreadful acting!! Willy Nelson was as stiff as his braids. The movie just seemed like a very long advert for the bright red lipstick that Jessica Simpson wore - especially as there were so many close-ups on her face. The premise was not amusing and as I said - soooooooo predictable. Whatever money was spent on making this movie was a shameful waste. Any allusions to other old Marilyn Monroe movies did not enhance the viewing of Blonde Ambition at all. It was also so unbelievable - Jessica Simpson being able to step into an executive secretary position at the drop of a hat - that was laughable!!!",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "Yet another example of the complete waste of UK Lottery money. Just how commercial did this film prove. The Film Council ,who funded this miserable garbage should be stranded, on one of the London Undergrounds disused stations, for allowing this clichéd, dismal specimen to be committed to film, a half mutant thing made up of all the horror movies the director has seen and felt fit to imitate, most notably Deathline. Amongst its many sins is the quite obvious failure to make the lead character remotely sympathetic until the last minute. It's a little bit too late then! Surely all those development executives, at the UK Film Council, could have noticed this at the script stage. Add to this the terrible acting and the laughable appearance of the creature and you get a prime example of how not to scare.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "\"The Godfather\", \"Citizen Kane\", \"Star Wars\", \"Goodfellas\" None of the above compare to the complex brilliance of \"The Sopranos\". Each and every character has layers upon layers of absolute verity, completely and utterly three dimensional. We care about Tony Soprano wholeheartedly, despite the fact that in the simplest model of good vs. evil, he is evil. Soprano is the most provocative, intricate, and fascinating protagonist ever created to this point in history. If you're in the mood to be overtly challenged as a viewer, and to be forever altered on your feelings toward entertainment, watch \"The Sopranos\". I defy anybody to sit down and watch the very first episode of Season 1, and not want to continue with the series. Each season is completely brilliant in its own way. DVDs are essential to anybody's collection **** of out 4",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "Movie industry is tricky business - because decisions have to be made and everyone involved has a private life, too. That's the very original thesis of this feeble attempt at making an 'insightful' film about film. And indeed, no better proof of the industry's trickiness than seeing Anouk Aimée and Maximilian Schell trapped in this inanity. The insight consists of talking heads rattle off bullshit like \"should I make a studio movie that pays a lot or should I make an indie item and stay true to my artistic self?\" \"Do the latter, please.\" Or: \"our relationship is not only professional, it's private as well. It's a rather complex situation to handle, isn't it?\" \"Yes, it is, my dear.\" Between the insipid dialogs one gets glimpses of palm trees, hotel lobbies and American movie posters (no sign of non-American film presence on the Croisette). Recurrent slumber sessions are inevitable, making the 100 minutes of the film feel like ages. Jenny Gabrielle is spectacularly unconvincing in justifying her own presence in the frame.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "I had no idea what the film is about before I saw it because Tashan only had teaser trailers while it was being promoted. So I asked my friends if they knew anything about it and they said that \"It is the directorial debut of Vijay Krishna Acharya who wrote the screenplays for Dhoom 1 & 2 and Saif Ali Khan's son Ibrahim makes his debut in the film by playing him as a child in his flashback\".<br /><br />After watching it, I understood that why their wasn't a proper trailer because there wasn't anything in the film to show. The story was extremely dum and even a 10 year old child can come up with a better story-line. There was hardly any action and the camera shook at every possible angle there is and it's difficult to figure out that who is killing who. Also the action was daft & unrealistic e.g. 1 man with a handgun managed to kill about 100 men with machine guns.<br /><br />While I was watching Tashan it reminded me of 3 films:<br /><br />Sin City: During the opening credits.<br /><br />Koyla: Anil Kapoor's terrible English like Amrish Puri in Koyla.<br /><br />Jhoom Barabar Jhoom: The outrageously ridiculous jokes that are not even a jot funny.<br /><br />I also heard the budget is 40 crores which is the same amount as Dhoom 2 and I don't know where all the money went to. Anyway if you did not like Dhoom 2 then there is absolutely no chance that you will like Tashan. Race was hot on heels and that is a million times better.<br /><br />The only 2 good songs are Dil Haara & Challiya and both songs are shot in Greece at good locations but what is the use of it in a rubbish film? Even Anil Kapoor's terrible English couldn't save this discomfiture.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "While to most people watching the movie, this will be of little interest, but out of the many hundreds of movies dealing with magic and the occult in one form or another, this one is probably the best in many ways.<br /><br />From The Golem to The Craft the subject seems to be of endless interest to the movie industry. The majority of movies which touch on it in any way do so childishly (for example \"Witchboard\", a true piece of utter garbage in every way) either taking the transcendental elements as cheap excuses for cheesy special effects or cardboard cutout villians (cf \"Warlock\"). More frequently the subject comes up in an hysterical religious context (in the various Revelations-oriented movies, the antichrist is inevitably an advocate of some kind of new-age style practice). Rarely, a movie seems to show at least some passing experience with magic as it is practiced in real life, but the presentation of the occult in such movies can at best be described as allegorical and not literal, or symbolic, or ... just not quite right.<br /><br />I watched this movie again after many years tonight. I had seen it before on VHS; it is a dark, moody piece, and after watching it on DVD, I would say if you have any intention to watch this movie, watch it on DVD, don't watch it on VHS.<br /><br />The darkness and moodiness are overpowering in VHS but in DVD the movie takes on a very different tone. I think Weir pushed the dark aspects intentionally for style, but when the movie is converted to the lower color medium of VHS this goes over the edge. DVD brings the movie to life again and I saw it differently.<br /><br />Anyway, seeing it as if for the first time, I realized that the treatment of magic is extremely good in this movie. It's difficult to go into all the reasons why, I don't care to take the time to do so.<br /><br />For anybody who's curious, anyway, if you want to see what it is like in real life, this movie is just very right on countless levels.<br /><br />And for anybody who isn't, you really wasted a lot of time reading to this point.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "The whole does not even come close to the sum of the parts. No problem. This film features a line-up of some of the most diversely creative directors of our time and some really famous names in the cast. The segments are devised around the same theme, \"Love in Paris\", but the resemblance ends there. Actually, considering that the approach to the theme from all these different directors takes so many forms, it is amazing that we can even feel we are still watching the same film. No great effort has been made to turn it into a comprehensive whole. This buffet has so many great ingredients, I am glad nobody tried to put them all in a single dish.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "Slow and nice images changed one another, with sometimes annoying music (you know Bjork) in background, for the first 75% of the movie. If you did not have enough sleep, that's a good time. <br /><br />But, in the last 20% of the movie director decides to bring idea of re-birth, re-incarnation or else, through S&M images: \"spiritual lovers\" are cutting each others bodies with knives. For me it was very much disturbing and actually changed general impression of blend of abstract art and images of modern Japanese mystery. <br /><br />Operator and director are great, but weird. <br /><br />Did not enjoy it at all.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "I first saw this when it premiered more than ten years ago. I saw it again today and it still had a big impact on me. She Fought Alone is about a girl, Caitlin (played by Tiffani Thiessen), who is raped by Jace (played by David Lipper), a classmate who enjoys hurting girls. Caitlin is in a popular high school clique, but when she reveals she is raped the clique turns against her, led by Ethan (played by Brian Austin Green).<br /><br />This movie chronicles Caitlin's struggle against an entire town, including a high school that essentially lets athletes determine the social environment, allowing them to get away with whatever they wish.<br /><br />Thiessen and Green are the top performers, and there is real chemistry between the two of the them throughout the entire film. All of the actors in this film, which was inspired by actual events, did a great job. She Fought Alone really captures the essence of what it is like to be in high school (at least in 1995), and having one's self-esteem and reputation at stake. Recommended. 10/10",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "with very little screen time and money, Dan Katzir manages to do so much. This movie, in its heart-warming simplicity, touches the beauty of love from a fresh angle. rejuvinated lust",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "The photography on the DVD is so dark I thought the screen had died. I think I missed seeing half of the movie. Still, it was poorly crafted and not interesting. I did not find the story related to the title \"The Black Widow\". I was hoping for a mystery or a thriller but did not get involved enough to care after the first few frames. I rented the movie especially for Willem Dafoe and was sad it wasted his talent. I do not believe Giada Colagrande has studied movie making long enough to develop a major motion picture. She is attractive and might develop into an actor but she took on too many tasks in this movie. Although they are married in real life, they lack chemistry on the screen. Their relationships did not seem believable. I do not understand why the other characters were even introduced into the plot.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "I remember back when I was little when I was away at camp and we would campout under the stars. There was always someone there that would have a good story to tell that involved the woods that surrounded us and they would always creep me out. Well, when I found Wendigo at the library, I checked it out hoping to be one of those films that had a supernatural being haunting people in the woods much like the stories that were told at camp. Well, much to my dismay, I was so far from the truth. Wendigo is really bad. The story starts of when a family of three is driving to their winter cabin, which looks like your normal suburban home and nothing like a cabin in the woods, and they run into a deer. Well, it seems the local rednecks were actually hunting this particular deer and are pretty upset at our city folk. The movie spends far too much time following the families everyday activities instead of getting to the point of the film. It wasn't until about the last 15 minutes that we actually have some action involving the \"wendigo.\" My suggestion is that you stay very far away this film. It will leave you wanting your hour and a half back.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "Farrah Fawcett has spent the better part of her post-Angel's career confounding us, with an occasional noteworthy acting performance sandwiched in between her Playboy frolics and Letterman escapades. But when it comes down to it, there's no denying that this girl can act. Far from a story of epic proportions, this well-done TV-movie is gentle, quiet and occasionally moving. Fawcett plays the wayward black sheep daughter come home only to find that she missed the last days of her mom's life as well as the funeral, much to the chagrin of her more stable and presumably more sensible sister. Brad Johnson plays the love interest, and a story unfolds with all the typical elements of telefilm drama- but then there's always that confounding Farrah to watch, and she does, indeed, remain eminently watchable. (And, yes, I admit it, I did have that Farrah poster on my wall way back when). Silk Hope gets three and a half stars (out of five) on the Corkymeter. Bosley would be proud.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "This early Biograph short was so much fun to watch. The second on disc one of D.W. Griffith's \"Years of Discovery\" DVD set (highly recommended) it features three excellent performances by the main leads, and interesting to see Henry B. Walthall (The Little Colonel, Birth of a Nation) as a campy musician giving a Countess the eye (and other things).<br /><br />The Countess' husband goes berserk at his wife's betrayal and has her walled into a little room with her paramour. It's kind of incredible that they wouldn't hear the wall going up, but hey, maybe the wine had something to do with it. Here Mr. Johnson (father of silent player Raymond Hackett) gesticulates wildly and this adds to the melodrama, but in an unexpectedly comical way. The best moment comes at the end. As the lady passes out from shock and fear, once she realizes she's doomed, Henry picks up his instrument and \"fans\" it over her. The way he did it was so unexpected and in a strange way kind of sexy, and I just lost it, and laughed my head off. The expression on his face! From that moment I was charmed by Henry B. Walthall.",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "I'm from Romania i'll try to speak in English. All i want to say about this movie is that it is and will be my all time number one. Seen it above 30 times at least and will see it for many years now. It has all the little things i like in a movie , it's very touching makes me cry . Shows a whole lot of twisted love things and questions about love and reality , and the true things that matter for different people. It so happens that for me this matters the most , the love , the soul of a man , he's inner being, and this i see in this movie. Perhaps for me it's much more than a motion picture , it's a proof in my mind that it could really exist and that you most make the best out of every moment you live with your soul mate. It's a long way from reality to sci-fi , but .. what if. What if all the capitalism disappeared and economy would go down , would fall? We would all be concerned about other issues and my thought is that , on your death bed , the bigger thing you remember , is not the wealth , not the adventure , not the countries you visited and the people that remember you. But the true friends and your true love and the hope that after you die , all will be god damn perfect and people would be good and care more. WATCH THIS MOVIE and probably it will guide you through your life like it did to me :) Hail from Romania",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "I've read all the rave reviews here and am impressed with the imagination of those who loved this film. I can't say that I found much to recommend it. The Leonard Cohen sound track is not only excessively heavy-handed but dreary beyond measure. The film looks authentic enough, but something's got to happen for it to work, and nothing much does: a cursory plot (not a real problem for me), not much character development, nothing thematically. It just slogs along. Flawed as it is, Cimino's \"Heaven's Gate\" has some moments of genuine wonder and is a film I'd sooner watch again. For a brilliant reconception of the West, HBO's \"Deadwood\" is much superior to \"McCabe.\"",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "Along with Darkwing Duck this is unfairly cancelled. Disney has been in decline since Tarzan and we need a show like this to get Disney back on track. Ed Gilbert and Jim Cummings were perfect for the voices of Louis and Baloo (sounds familiar?) The theme theme tune is also catchy. Out of all the villains, which are all great on their own merits, Tony Jay stands out as Shere Kahn. Louis and Baloo actually sound very similar to the voice overs in the Jungle Book, which isn't a bad thing at all. As a matter of fact, it's quite inspirational! The animation was spot on, and the script had plenty of wit that has been severely lacking in animations for years. PLEASE BRING THIS SHOW BACK! 9/10. Bethany Cox",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "This so-called \"documentary\" tries to tell that USA faked the moon-landing. Year right.<br /><br />All those who have actually studied the case knows different.<br /><br />First of all: there is definitely proof. When the astronauts was on the moon, they brought back MANY pounds of rock from the moon - for geological studies. These where spread around the world to hundreds of labs, who tested them. And they all concluded that they came from the same planet, not earth: because the inner isotopes of the basic elements are different from those found on earth, but similar to those calculated to be on the moon. I.E. the conspiracy theorists never studies anything: they only take the thing that fit into their theory and ignores the rest.<br /><br />Another wrongful claim from them is that their was wind in the hangar where they shot the moon landing, I.E. the flag moves. There is a logical explanation: the astronaut moved it with his hand, so it moved. And what proves this: well, if the conspiracy theorists even studied the footage, they would see that the flag NEVER moves after the astronaut have let it be, I.E. the conspiracy theorists are bad-scientists, they cant study a subject properly, or only studies it until they have what they came for, so that they can make a lie from that, and make a profit (I.E. this so-called \"documentary\").<br /><br />A claim says that it cant possible have been filmed on the moon because all the shadows come from different places, because there are different light-sources, the artificial lighting from the studio. Once again the conspiracy theorists are wrong (as usual), the same would happen in an earth desert at night, with no light-sources. But i doubt that any Conspiracy theorists have ever been outside their grandmothers basement for more than how many days a Star Treck-convention is held over.<br /><br />The Conspiracy theorists are in denial, BIG TIME. They only see what they want to see. So they make up all these lies to seem important - that is a fact.",
        "label": 0,
        "label_text": "negative"
    },
    {
        "text": "De Palma's technique had hit its high maturity by the time of this film, which is a wonderful showcase of his classic techniques, though unfortunately, as with many of the films written by De Palma himself, the story serves the meta more than the interests of putting forth an emotionally compelling tale. <br /><br />The story opens with a CRAZY scene in which Angie Dickinson masturbates in a shower while she looks at her husband. She is then grabbed and raped while he husband stands obliviously near-and the whole thing is revealed to be Angie's fantasy as he husband is pumping mindlessly away at her in bed. She has a short scene with her son, a dead ringer for Harry Potter, which concludes with a joke that \"she'll tell grandma that he is playing with his peter.\" She then goes to her therapy session, where she complains about her dead marriage, before attempting to seduce her therapist, Michael Caine. He refuses, and she is hurt and feeling unattractive and unfulfilled.<br /><br />Then begins a bravura 22-minute nearly wordless sequence that is perhaps the highlight of the film. Among the many things De Palma gleaned from Hitchcock is the understanding of film as a purely visual medium of telling stories and in typical De Palma fashion, he turns this into a way to show off his formidable skill. The problem, for me, is that in this instance one begins to feel that scenes are being needlessly protracted simply to further show off the director's skill. <br /><br />The sequence begins with Angie at an art museum. She watches strangers, all involved in sexual or family activities, then begins to get turned on to a man sitting next to her. De Palma very skillfully tells an extremely complicated narrative without a single word about Angie's attraction, embarrassment, retreating, and finally finding and submitting to the stranger in the back of a taxi cab, all set to a wonderfully lush score by Pino Donaggio, who also scored Carrie.<br /><br />In the second part of the sequence Angie has slept with the guy, and gets up to return to her husband. Again De Palma crams a ton of narrative in without a word of dialogue uttered, as Angie realizes that she doesn't have her panties, that her husband is already home and no doubt wondering where she is, that she has probably contracted a venereal disease, and that she has lost her engagement ring somewhere in the shuffle. It's all very admirable, but one begins to feel a little strung along as we are forced to do things like take a long elevator ride down from the seventh floor, then up again, almost in real time.<br /><br />...Spoilers from here on out! When Angie reaches the seventh floor again, she is killed by a big woman with blond hair. The woman hacks away at her until she reaches the ground floor, when the door opens and Nancy Allen sees her there. There is a wonderful slow-motion sequence as Nancy reaches into the elevator, Angie reaches up toward her, and the killer's blade is held poised to slash Nancy's hands. Then follow some electrifying shots as Nancy looks up and sees the killer in the elevators convex mirror. It's all good, and by the time we have some dialogue again, you think; \"Woah, that was just 22 straight minutes of purely visual narrative!\" Or maybe you don't, but I do.<br /><br />A younger Dennis Franz has a great part as a sleazy and tough New York detective who would rather that everyone else do his work for him. He Interviews Michael Caine, making the outrageous implication (though it passes as commonplace) that Angie WANTED to be killed. Angie's son is there as well, and he hooks up with Nancy, and they set about to spy on Caine's therapist and find out who the killer is.<br /><br />Once again there is a strong tie to a Hitchcock film, in this case Psycho (just as Obsession is a re-working of Vertigo). You have a woman who we are supposed to understand is secretly a slut, who gets killed in the first 30 minutes in an enclosed space, in this case an elevator rather than a shower. Then the relatives of the deceased conduct an investigation, which reveals that the killer is a man who dresses as a woman to kill. De Palma even throws in a doctor at the end who explains the psychology of the whole thing. <br /><br />It is very interesting, but at the same time a viewer can begin to feel a bit jerked around, and that is my primary reservation about this film. It is definitely essential viewing and showcases some of De Palma's greatest setpieces, but that feeling that the story is running a solid third behind the need for De Palma to show off and his somewhat unseemly sexual fantasies makes it hard to look back on this one with whole-hearted affection.<br /><br />--- Check out other reviews on my website of bad and cheesy movies, Cinema de Merde, cinemademerde.com",
        "label": 1,
        "label_text": "positive"
    },
    {
        "text": "Fully deserving its prestigious Hollywood award nomination, this is an entertaining little gem with lots of pizazz and some delightful surprises. Outstandingly funny scenes include an hilarious shoot (and re-shoot) of a WW1 trench scene with Australian comedian Clyde Cook as an optimistic non-com and the hapless McDoakes as a Boyer/Colman messenger  all under the beady eye of Ralph Sanford's delightfully irascible Anguish; a lost McDoakes guided and re-guided by equally perplexed Jack Carson; assistant director Chandler rejoicing in a McDoakes-sent opportunity: \"I'm going to be a director!\" <br /><br />Ace comic O'Hanlon has a dual role, playing both McDoakes and himself playing McDoakes! Oddly, Richard L. Bare who does play himself in one or more other entries in the series, has turned down that opportunity here. In real life, Bare's a youngish, six-foot Rock Hudson lookalike, but here he's impersonated by veteran actor (over 500 movies!), Jack Mower.",
        "label": 1,
        "label_text": "positive"
    }
]